int123123/Jackett/esp32c3-virtual-pult/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c3"

# Use NimBLE (recommended for ESP32-C3)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_NIMBLE_ENABLED=y
CONFIG_NIMBLE_STACK_USE_MEM_POOLS=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y

# Reduce logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# GPIO pullups are handled in code
